Tekla Open API Reference for Tekla Structures 2025
RebarItemEnumerator.ModifyRebarItem Method
 Modify the RebarItem in the list
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ModifyRebarItem(
	RebarItem rebarItem,
	RebarItem originalRebarItem
)
Public Shared Function ModifyRebarItem (
	rebarItem As RebarItem,
	originalRebarItem As RebarItem
) As Boolean
Parameters
rebarItem
Type: Tekla.Structures.Catalogs.RebarItem
item to modify
originalRebarItem
Type: Tekla.Structures.Catalogs.RebarItem
original Rebar Item to match
Return Value
Type: Boolean
True on success
See Also
Reference
RebarItemEnumerator Class
Tekla.Structures.Catalogs Namespace